Repository: mr258876/PRISM-Utility
Catalog: PRISM Utility/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# ScanDebug_Runtime_RoiIssueCode_TooNarrow
source: range is too narrow
zh_cn: 范围过窄

# ScanDebug_Runtime_RoiIssueCode_Overlap
source: overlaps another range
zh_cn: 与其他范围重叠

# ScanDebug_Runtime_RoiIssueCode_DoesNotContain
source: does not contain required ranges
zh_cn: 未包含所需范围

# ScanDebug_Runtime_RoiIssueCode_Unknown
source: invalid range
zh_cn: 范围无效

# Settings_RestoreScanTransferDefaultsButton.Content
source: Restore defaults
zh_cn: 恢复默认值

# Settings_BuildDescriptionFormat
source: Build - {0}
zh_cn: 构建 - {0}

# Scan_ScanMotorComboBox.Header
source: Scan Motor
zh_cn: 扫描电机

# Scan_MotorIntervalTextBox.Header
source: Motor movement per line
zh_cn: 每行电机移动距离

# Scan_MotorIntervalTextBox.PlaceholderText
source: Enter value
zh_cn: 输入数值

# Scan_MotorIntervalUnitComboBox.Header
source: Unit
zh_cn: 单位

# Scan_MotorIntervalUnitComboBox.PlaceholderText
source: Select unit
zh_cn: 选择单位

# Scan_ConfigProfileTextBox.Header
source: Config profile
zh_cn: 配置文件

# Scan_LoadConfigButton.Content
source: Load Config
zh_cn: 加载配置

# Scan_Led1LevelTextBox.Header
source: LED1 Level
zh_cn: LED1 电平

# Scan_Led2LevelTextBox.Header
source: LED2 Level
zh_cn: LED2 电平

# Scan_Led3LevelTextBox.Header
source: LED3 Level
zh_cn: LED3 电平

# Scan_Led4LevelTextBox.Header
source: LED4 Level
zh_cn: LED4 电平

# Shared_Dialog_UsbBusy.Title
source: USB busy
zh_cn: USB 忙碌

# Shared_Dialog_Ok.CloseButtonText
source: OK
zh_cn: 确定

# Shared_Dialog_Error.Title
source: Error
zh_cn: 错误

# Shared_Dialog_UsbBusy_UsbDebugBlockedByScanDebug.Content
source: USB Debugging is unavailable while Scan Debug is connected. Disconnect Scan Debug first.
zh_cn: 扫描调试已连接时，USB 调试不可用。请先断开扫描调试。

# Shared_Dialog_UsbBusy_ScanDebugBlockedByUsbDebug.Content
source: Scan Debug is unavailable while USB Debugging is active. Stop USB Debugging first.
zh_cn: USB 调试处于活动状态时，扫描调试不可用。请先停止 USB 调试。

# Shared_Runtime_ErrorIntegerRange0To65535
source: {0} must be an integer in [0, 65535].
zh_cn: {0} 必须是 [0, 65535] 范围内的整数。

# Shared_Runtime_ErrorNumber
source: {0} must be a number.
zh_cn: {0} 必须是数字。

# UsbDebug_Runtime_BulkInMissingParams
source: Bulk IN parameters are incomplete.
zh_cn: Bulk IN 参数不完整。

# UsbDebug_Runtime_BulkInStarted
source: Bulk IN started.
zh_cn: Bulk IN 已启动。

# UsbDebug_Runtime_BulkInError
source: Bulk IN error: {0}
zh_cn: Bulk IN 错误：{0}

# UsbDebug_Runtime_BulkInStopped
source: Bulk IN stopped.
zh_cn: Bulk IN 已停止。

# UsbDebug_Runtime_BulkInStopping
source: Stopping Bulk IN...
zh_cn: 正在停止 Bulk IN...

# UsbDebug_Runtime_BulkOutMissingParams
source: Bulk OUT parameters are incomplete.
zh_cn: Bulk OUT 参数不完整。

# UsbDebug_Runtime_BulkOutPayloadRequired
source: Please input payload text.
zh_cn: 请输入负载文本。

# UsbDebug_Runtime_BulkOutError
source: Bulk OUT error: {0}
zh_cn: Bulk OUT 错误：{0}

# UsbDebug_Runtime_BulkOutFailed.Title
source: Bulk OUT failed
zh_cn: Bulk OUT 失败

# UsbDebug_Runtime_NoHexBytesFound
source: No hex bytes found.
zh_cn: 未找到十六进制字节。

# UsbDebug_Runtime_HexTokenLength
source: Token #{0} must be exactly 2 hex digits (supports 0xAA / AAh / AAH / AA).
zh_cn: 第 {0} 个标记必须正好为 2 位十六进制数字（支持 0xAA / AAh / AAH / AA）。

# UsbDebug_Runtime_HexTokenInvalid
source: Token #{0} is not valid hex: '{1}'.
zh_cn: 第 {0} 个标记不是有效的十六进制值：'{1}'。

# UsbDebug_ObservationStatus_ReadOnly
source: Read-only observation mode: another scanner workflow owns the PRISM devices. You can inspect session state, logs, and device information here, but Bulk IN/OUT is unavailable until that session disconnects.
zh_cn: 只读观察模式：其他扫描流程正占用 PRISM 设备。你可以在此查看会话状态、日志和设备信息，但在该会话断开前无法使用 Bulk IN/OUT。

# UsbDebug_ObservationStatus_ExclusiveActive
source: Exclusive raw diagnostics mode is active for the PRISM scanner devices. USB Debug currently owns the raw USB lease and can use Bulk IN/OUT.
zh_cn: PRISM 扫描仪设备的独占原始诊断模式已启用。USB Debug 当前持有原始 USB 租约，可使用 Bulk IN/OUT。

# UsbDebug_ObservationStatus_ExclusiveAvailable
source: Exclusive raw diagnostics are available while no scanner workflow owns the PRISM devices. Bulk IN/OUT will claim the raw USB lease on demand.
zh_cn: 当前没有扫描流程占用 PRISM 设备，可使用独占原始诊断。Bulk IN/OUT 会按需获取原始 USB 租约。

# UsbDebug_Runtime_ReadOnlyObservationOnly.Content
source: A scanner session currently owns the PRISM devices. USB Debug remains available for read-only observation of session state, logs, and device information, but raw Bulk IN/OUT commands are unavailable until that session disconnects.
zh_cn: 扫描会话当前正占用 PRISM 设备。USB Debug 仍可只读观察会话状态、日志和设备信息，但在该会话断开前无法使用原始 Bulk IN/OUT 命令。

# UsbDebug_Runtime_ExclusiveLeaseUnavailable.Content
source: USB Debug could not acquire exclusive raw access because the device is already owned by {0} for {1}.
zh_cn: USB Debug 无法获取独占原始访问权限，因为设备已由 {0} 用于 {1}。

# UsbDebug_Runtime_ExclusiveLeaseUnavailableFallback.Content
source: USB Debug could not acquire exclusive raw access for this operation.
zh_cn: USB Debug 无法为此操作获取独占原始访问权限。

# Scan_Runtime_StatusWaitingForDevices
source: Waiting for scanner devices 1D50:619C and 1D50:619D.
zh_cn: 正在等待扫描仪设备 1D50:619C 和 1D50:619D。

# Scan_Runtime_StatusDevicesDetected
source: 619C/619D detected. Click Connect Devices to open scanner sessions for Scan.
zh_cn: 已检测到 619C/619D。点击“连接设备”以为扫描打开扫描仪会话。

# Scan_Runtime_UsbDebugActive
source: USB Debugging is active. Stop it before connecting the Scan page.
zh_cn: USB 调试处于活动状态。连接扫描页面前请先停止它。

# Scan_Runtime_StatusLoadingState
source: Scanner sessions connected. Loading scan state...
zh_cn: 扫描仪会话已连接。正在加载扫描状态...

# Scan_Runtime_StatusParametersLoaded
source: Parameters loaded (exp={0}, sysclk={1} kHz)
zh_cn: 参数已加载（exp={0}, sysclk={1} kHz）

# Scan_Runtime_StatusParameterLoadUnavailable
source: Parameter load unavailable: {0}
zh_cn: 参数加载不可用：{0}

# Scan_Runtime_StatusIlluminationLoaded
source: Illumination levels loaded
zh_cn: 照明电平已加载

# Scan_Runtime_StatusIlluminationUnavailable
source: Illumination unavailable: {0}
zh_cn: 照明不可用：{0}

# Scan_Runtime_StatusConnectedWithNotes
source: Scanner sessions connected. {0}.
zh_cn: 扫描仪会话已连接。{0}。

# Scan_Runtime_StatusConnected
source: Scanner sessions connected.
zh_cn: 扫描仪会话已连接。

# Scan_Runtime_StatusConnectFailed
source: Connect failed: {0}
zh_cn: 连接失败：{0}

# Scan_Runtime_StatusDisconnectedReconnect
source: Disconnected. Click Connect Devices to reconnect.
zh_cn: 已断开连接。点击“连接设备”重新连接。

# Scan_Runtime_StatusDisconnected
source: Disconnected.
zh_cn: 已断开连接。

# Scan_Runtime_ServiceDevicesNotDetected
source: Scanner devices 619C and 619D were not detected.
zh_cn: 未检测到扫描仪设备 619C 和 619D。

# Scan_Runtime_ServiceDeviceDisappearedDuringConnect
source: A scanner device disappeared during connect.
zh_cn: 连接过程中有扫描仪设备消失。

# Scan_Runtime_ServiceEndpointCheckFailed
source: Endpoint check failed. Required endpoints: 619C IN 0x82 and 619D OUT 0x01 / IN 0x81.
zh_cn: 端点检查失败。所需端点：619C IN 0x82 和 619D OUT 0x01 / IN 0x81。

# Scan_Runtime_ServiceEndpointInterfaceMismatch
source: Endpoint check failed. 619D OUT 0x01 and IN 0x81 must be on the same interface.
zh_cn: 端点检查失败。619D OUT 0x01 和 IN 0x81 必须位于同一接口上。

# Scan_Runtime_ServiceScannerNotConnected
source: Scanner not connected. Click Connect Devices first.
zh_cn: 扫描仪未连接。请先点击“连接设备”。

# Scan_Runtime_ServiceScannerNotConnectedShort
source: Scanner not connected.
zh_cn: 扫描仪未连接。

# Scan_Runtime_StatusScanLinesConfigured
source: Scan lines configured. 619C input opened. Starting scan...
zh_cn: 扫描行已配置。619C 输入已打开。正在开始扫描...

# Scan_Runtime_StatusReadStartedSendingStartScan
source: 619C read started. Sending START_SCAN...
zh_cn: 619C 读取已开始。正在发送 START_SCAN...

# Scan_Runtime_StatusScanCommandSentReceiving
source: Scan command sent. Receiving image lines...
zh_cn: 扫描命令已发送。正在接收图像行...

# Scan_Runtime_StatusAckMonitorTimedOut
source: START_SCAN ACK monitor timed out.
zh_cn: START_SCAN ACK 监视超时。

# Scan_Runtime_StatusDeviceBusy
source: Device busy (cmd=0x{0}).
zh_cn: 设备忙碌（cmd=0x{0}）。

# Scan_Runtime_StatusDeviceBusyTooLong
source: Device stayed busy for too long.
zh_cn: 设备忙碌时间过长。

# Scan_Runtime_StatusStartScanAckStatus
source: START_SCAN ACK status: {0} (0x{1})
zh_cn: START_SCAN ACK 状态：{0} (0x{1})

# Scan_Runtime_StatusStartScanAckTargetMismatch
source: START_SCAN ACK target mismatch: {0} (expected {1})
zh_cn: START_SCAN ACK 目标不匹配：{0}（预期 {1}）

# Scan_Runtime_StatusStartScanAckReceived
source: START_SCAN ACK received.
zh_cn: 已收到 START_SCAN ACK。

# Scan_Runtime_StatusStartScanDoneAckReceived
source: START_SCAN done ACK received.
zh_cn: 已收到 START_SCAN 完成 ACK。

# Scan_Runtime_StatusStartScanDoneAckTimeout
source: START_SCAN done ACK not received in time.
zh_cn: 未及时收到 START_SCAN 完成 ACK。

# Scan_Runtime_StatusScanCompleted
source: Scan completed.
zh_cn: 扫描已完成。

# Scan_Runtime_StatusScanStopped
source: Scan stopped.
zh_cn: 扫描已停止。

# Scan_Runtime_StatusScanCompletedInSegments
source: Scan completed in {0} segment(s).
zh_cn: 扫描已分 {0} 段完成。

# Scan_Runtime_StatusScanFailedAfterMs
source: Scan failed after {0} ms: {1}
zh_cn: 扫描在 {0} ms 后失败：{1}

# Scan_Runtime_StatusSegmentDoneAckTimeout
source: Segment {0}/{1} done ACK was not received in time.
zh_cn: 未及时收到第 {0}/{1} 段完成 ACK。

# Scan_Runtime_StatusUnexpectedStopAck
source: Unexpected ACK command while stopping: 0x{0}
zh_cn: 停止时收到意外 ACK 命令：0x{0}

# Scan_Runtime_StatusStopAckReceived
source: STOP_SCAN ACK received (target={0}, completed={1}).
zh_cn: 已收到 STOP_SCAN ACK（target={0}, completed={1}）。

# Scan_Runtime_StatusStopAckStatus
source: STOP_SCAN ACK status: {0} (0x{1})
zh_cn: STOP_SCAN ACK 状态：{0} (0x{1})

# Scan_Runtime_StatusStopSendFailed
source: STOP_SCAN send failed: {0}
zh_cn: 发送 STOP_SCAN 失败：{0}

# Scan_Runtime_WorkflowEnableMotor
source: Enabling Motor{0} for scan transport...
zh_cn: 正在为扫描传送启用 Motor{0}...

# Scan_Runtime_WorkflowApplyCcdProfile
source: Pass {0}/{1}: applying CCD profile for {2} channel...
zh_cn: 第 {0}/{1} 轮：正在为 {2} 通道应用 CCD 配置...

# Scan_Runtime_WorkflowPrepareMotorOnExposureSync
source: Pass {0}/{1}: preparing Motor{2} {3} for {4} step(s), waiting for EXPOSURE_SYNC...
zh_cn: 第 {0}/{1} 轮：正在准备 Motor{2} {3} {4} 步，等待 EXPOSURE_SYNC...

# Scan_Runtime_WorkflowCaptureRows
source: Pass {0}/{1}: LED{2} active, capturing {3} row(s)...
zh_cn: 第 {0}/{1} 轮：LED{2} 已激活，正在采集 {3} 行...

# Scan_Runtime_WorkflowReturnMotor
source: Pass {0}/{1}: returning Motor{2} to start position before the next channel scan...
zh_cn: 第 {0}/{1} 轮：正在将 Motor{2} 返回起始位置，以便进行下一通道扫描...

# Scan_Runtime_WorkflowReturnMotorToStartPosition
source: Pass {0}/{1}: returning Motor{2} to start position...
zh_cn: 第 {0}/{1} 轮：正在将 Motor{2} 返回起始位置...

# Scan_Runtime_WorkflowPassComplete
source: Pass {0}/{1} complete.
zh_cn: 第 {0}/{1} 轮完成。

# Scan_Runtime_WorkflowCompleted
source: Four-channel scan workflow completed.
zh_cn: 四通道扫描流程已完成。

# Scan_Runtime_WorkflowCompletedWithPassCount
source: Scan workflow completed with {0} pass(es).
zh_cn: 扫描流程已完成，共 {0} 轮。

# Scan_Runtime_WorkflowPassFailed
source: Pass {0} failed: {1}
zh_cn: 第 {0} 轮失败：{1}

# ScanDebug_Runtime_WorkflowEnableMotor
source: Enabling Motor{0} for scan transport...
zh_cn: 正在为扫描传送启用 Motor{0}...

# ScanDebug_Runtime_WorkflowApplyCcdProfile
source: Pass {0}/{1}: applying CCD profile for {2} channel...
zh_cn: 第 {0}/{1} 轮：正在为 {2} 通道应用 CCD 配置...

# ScanDebug_Runtime_WorkflowPrepareMotorOnExposureSync
source: Pass {0}/{1}: preparing Motor{2} {3} for {4} step(s), waiting for EXPOSURE_SYNC...
zh_cn: 第 {0}/{1} 轮：正在准备 Motor{2} {3} {4} 步，等待 EXPOSURE_SYNC...

# ScanDebug_Runtime_WorkflowCaptureRows
source: Pass {0}/{1}: LED{2} active, capturing {3} row(s)...
zh_cn: 第 {0}/{1} 轮：LED{2} 已激活，正在采集 {3} 行...

# ScanDebug_Runtime_WorkflowReturnMotor
source: Pass {0}/{1}: returning Motor{2} to start position before the next channel scan...
zh_cn: 第 {0}/{1} 轮：正在将 Motor{2} 返回起始位置，以便进行下一通道扫描...

# ScanDebug_Runtime_WorkflowReturnMotorToStartPosition
source: Pass {0}/{1}: returning Motor{2} to start position...
zh_cn: 第 {0}/{1} 轮：正在将 Motor{2} 返回起始位置...

# ScanDebug_Runtime_WorkflowPassComplete
source: Pass {0}/{1} complete.
zh_cn: 第 {0}/{1} 轮完成。

# ScanDebug_Runtime_WorkflowCompleted
source: Four-channel scan workflow completed.
zh_cn: 四通道扫描流程已完成。

# ScanDebug_Runtime_WorkflowCompletedWithPassCount
source: Scan workflow completed with {0} pass(es).
zh_cn: 扫描流程已完成，共 {0} 轮。

# ScanDebug_Runtime_WorkflowPassFailed
source: Pass {0} failed: {1}
zh_cn: 第 {0} 轮失败：{1}

# Scan_Runtime_StatusRowsLimitExceeded
source: Rows above {0} require Multi-buffer bulk IN and Raw I/O, or enable Warm-up segmented mode.
zh_cn: 高于 {0} 的行数需要启用 Multi-buffer bulk IN 和 Raw I/O，或启用预热分段模式。

# Scan_Runtime_OutputSummaryInProgress
source: Scan in progress...
zh_cn: 扫描进行中...

# Scan_Runtime_OutputSummaryCaptured
source: Captured {0} pass(es), rows={1}, motor steps/pass={2}. Transport followed the configured per-line movement distance.
zh_cn: 已采集 {0} 轮，rows={1}，每轮电机步数={2}。传送按已配置的每行移动距离执行。

# Scan_Runtime_StatusCompleted
source: Scan completed.
zh_cn: 扫描已完成。

# Scan_Runtime_StatusCanceled
source: Scan canceled.
zh_cn: 扫描已取消。

# Scan_Runtime_StatusFailed
source: Scan failed: {0}
zh_cn: 扫描失败：{0}

# Scan_Runtime_OutputSummaryFailed
source: Scan failed before outputs were produced.
zh_cn: 在生成输出前扫描失败。

# Scan_Runtime_StatusStopRequested
source: Stop requested.
zh_cn: 已请求停止。

# Scan_Runtime_StatusNoRgbResult
source: No scan result available for RGB save.
zh_cn: 没有可用于保存 RGB 的扫描结果。

# Scan_Runtime_StatusRgbSaveCanceled
source: RGB save canceled.
zh_cn: RGB 保存已取消。

# Scan_Runtime_StatusRgbSaving
source: Generating and saving RGB image...
zh_cn: 正在生成并保存 RGB 图像...

# Scan_Runtime_StatusRgbSaved
source: RGB image saved: {0}
zh_cn: RGB 图像已保存：{0}

# Scan_Runtime_StatusRgbSaveFailed
source: RGB save failed: {0}
zh_cn: RGB 保存失败：{0}

# Scan_Runtime_StatusNoDngResult
source: No scan result available for DNG export.
zh_cn: 没有可用于 DNG 导出的扫描结果。

# Scan_Runtime_StatusDngExportCanceled
source: DNG export canceled.
zh_cn: DNG 导出已取消。

# Scan_Runtime_StatusDngExported
source: DNG channel files exported to {0}
zh_cn: DNG 通道文件已导出到 {0}

# Scan_Runtime_StatusDngExportedWithAlignmentWarning
source: DNG channel files exported to {0}; alignment fell back for {1}.
zh_cn: DNG 通道文件已导出到 {0}；{1} 的对齐已回退。

# Scan_Runtime_DngAlignmentWarningTitle
source: DNG exported with alignment warning
zh_cn: DNG 已导出，但存在对齐警告

# Scan_Runtime_DngAlignmentWarningText
source: DNG was exported, but alignment fell back to normalized source data for {0}. Retry alignment or rescan if fully aligned channels are required. Details are available in Scanner Log.
zh_cn: DNG 已导出，但 {0} 的对齐回退为归一化源数据。如果需要完全对齐的通道，请重试对齐或重新扫描。详细信息可在 Scanner Log 中查看。

# Scan_Runtime_DngAlignmentWarningUnknownChannels
source: unknown channels
zh_cn: 未知通道

# ScanDebug_Runtime_StatusMonochromeDngExported
source: Monochrome DNG exported to {0}
zh_cn: 单色 DNG 已导出到 {0}

# ScanDebug_Runtime_StatusWorkflowPreviewChannelUnavailable
source: The selected workflow preview channel is unavailable.
zh_cn: 所选 workflow 预览通道不可用。

# Scan_Runtime_StatusDngExportFailed
source: DNG export failed: {0}
zh_cn: DNG 导出失败：{0}

# Scan_Runtime_FieldLed1Level
source: LED1 level
zh_cn: LED1 电平

# Scan_Runtime_FieldLed2Level
source: LED2 level
zh_cn: LED2 电平

# Scan_Runtime_FieldLed3Level
source: LED3 level
zh_cn: LED3 电平

# Scan_Runtime_FieldLed4Level
source: LED4 level
zh_cn: LED4 电平

# Scan_Runtime_FieldRedWavelengthNm
source: Red wavelength (nm)
zh_cn: 红色波长 (nm)

# Scan_Runtime_FieldGreenWavelengthNm
source: Green wavelength (nm)
zh_cn: 绿色波长 (nm)

# Scan_Runtime_FieldBlueWavelengthNm
source: Blue wavelength (nm)
zh_cn: 蓝色波长 (nm)

# Scan_Runtime_FieldOutputGamma
source: Output gamma
zh_cn: 输出伽马

# Scan_Runtime_FieldManualWhitePointColorTemperatureK
source: Manual color temperature (K)
zh_cn: 手动色温 (K)

# Scan_Runtime_TargetWhitePointModeManualColorTemperature
source: Manual color temperature
zh_cn: 手动色温

# Scan_Runtime_CurrentPassIdle
source: Pass - of 4
zh_cn: 第 - / 4 轮

# Scan_Runtime_CurrentPassCanceled
source: Pass canceled
zh_cn: 当前轮次已取消

# Scan_Runtime_CurrentPassProgress
source: Pass {0} of {1} - {2}
zh_cn: 第 {0} / {1} 轮 - {2}

# Scan_Runtime_CurrentLedStopped
source: LED: Idle
zh_cn: LED：空闲

# Scan_Runtime_CurrentDirectionIdle
source: Direction: -
zh_cn: 方向：-

# Scan_Runtime_CurrentDirectionStopped
source: Direction: Idle
zh_cn: 方向：空闲

# Scan_Runtime_CurrentDirectionProgress
source: Direction: {0}
zh_cn: 方向：{0}

# Scan_Runtime_PreviewPlaceholderInitial
source: Run a scan to generate RGB or raw channel preview output.
zh_cn: 运行一次扫描以生成 RGB 或原始通道预览输出。

# Scan_Runtime_PreviewPlaceholderNextScan
source: {0} preview will appear here after the next scan.
zh_cn: 下次扫描后，{0} 预览将显示在此处。

# Scan_Runtime_PreviewDisabledDescription
source: Preview is disabled.
zh_cn: 预览已禁用。

# Scan_Runtime_PreviewDisabledPlaceholder
source: Preview disabled.
zh_cn: 预览已禁用。

# Scan_Runtime_PreviewModeDescription
source: Preview mode: {0}.
zh_cn: 预览模式：{0}。

# Scan_Runtime_PreviewCompositeDescription
source: Preview mode: {0}. Alignment: {1}. Composite uses current channel-role mapping and {2}.
zh_cn: 预览模式：{0}。对齐：{1}。合成预览使用当前通道角色映射和 {2}。

# Scan_Runtime_PreviewCompositeModeSpectral
source: spectral sRGB color management
zh_cn: 光谱 sRGB 色彩管理

# Scan_Runtime_PreviewCompositeModeGamma
source: sRGB gamma encoding
zh_cn: sRGB 伽马编码

# Scan_Runtime_PreviewRawUnavailable
source: Selected raw preview channel is unavailable.
zh_cn: 所选原始预览通道不可用。

# Scan_Runtime_PreviewRawDescription
source: Preview mode: {0}. Alignment: {1}. Showing grayscale raw buffer from pass {2}.
zh_cn: 预览模式：{0}。对齐：{1}。正在显示第 {2} 轮的灰度原始缓冲区。

# Scan_Runtime_OutputSummaryEmpty
source: No scan outputs captured yet.
zh_cn: 尚未采集任何扫描输出。

# Scan_Runtime_ChannelMappingSummary
source: Channel 1 → {0}, Channel 2 → {1}, Channel 3 → {2}, Channel 4 → {3}.
zh_cn: 通道 1 → {0}，通道 2 → {1}，通道 3 → {2}，通道 4 → {3}。

# Scan_Runtime_ComputedMotorUnavailableUntilRowsValid
source: Motor step estimate unavailable until rows are valid.
zh_cn: 在行数有效前，无法估算电机步数。

# Scan_Runtime_ComputedMotorIntervalMinimum
source: The requested per-line motor movement is too small for current timing limits. Increase it until the derived motor interval is at least {0} us.
zh_cn: 请求的每行电机移动距离过小，不满足当前时序限制。请增大该值，使推导出的电机间隔至少为 {0} us。

# Scan_Runtime_ComputedMotorUnavailableUntilParametersLoaded
source: Motor step estimate unavailable until scanner parameters are loaded.
zh_cn: 在扫描仪参数加载前，无法估算电机步数。

# Scan_Runtime_ComputedMotorSummary
source: Motor{0} transport estimate: {1} step(s) per pass (~{4} mm) at ~{5} mm/s, derived from the requested per-line motor movement and current exposure/system clock across {3} row(s).
zh_cn: 基于请求的每行电机移动距离、当前曝光/系统时钟和 {3} 行，估算 Motor{0} 传送为每轮 {1} 步（约 {4} mm），线速度约 {5} mm/s。

# Scan_Runtime_ErrorRowsPositiveInteger
source: Rows must be a positive integer.
zh_cn: 行数必须是正整数。

# Scan_Runtime_ErrorMotorIntervalMinimum
source: The requested per-line motor movement must resolve to a derived motor interval >= {0} us.
zh_cn: 请求的每行电机移动距离必须能推导出 >= {0} us 的电机间隔。

# Scan_Runtime_ConfigProfileNotSelected
source: No config profile loaded
zh_cn: 未加载配置文件

# Scan_Runtime_StatusLoadConfigProfileCanceled
source: Config profile load canceled.
zh_cn: 加载配置文件已取消。

# Scan_Runtime_StatusConfigProfileLoaded
source: Loaded config profile "{0}" and applied saved LED and motor settings.
zh_cn: 已加载配置文件 "{0}"，并应用已保存的 LED 和电机设置。

# Scan_Runtime_StatusConfigProfileLoadedLegacy
source: Loaded config profile "{0}". This file does not contain LED or motor settings.
zh_cn: 已加载配置文件 "{0}"。此文件不包含 LED 或电机设置。

# Scan_Runtime_StatusLoadConfigProfileFailed
source: Failed to load config profile: {0}
zh_cn: 加载配置文件失败：{0}

# Scan_Runtime_ErrorParametersNotLoaded
source: Scanner parameters are not loaded yet. Reconnect the scanner and try again.
zh_cn: 扫描仪参数尚未加载。请重新连接扫描仪后再试。

# Scan_Runtime_ErrorScanMotorRange
source: Scan motor must be one of Motor1..Motor{0}.
zh_cn: 扫描电机必须是 Motor1..Motor{0} 之一。

# Scan_Runtime_DirectionForward
source: Forward
zh_cn: 正向

# Scan_Runtime_DirectionReverse
source: Reverse
zh_cn: 反向

# Scan_Runtime_ProgressStagePreparing
source: Preparing
zh_cn: 准备中

# Scan_Runtime_ProgressStageScanning
source: Scanning
zh_cn: 扫描中

# Scan_Runtime_ProgressStageWaitingForMotor
source: Waiting for motor
zh_cn: 等待电机

# Scan_Runtime_ProgressStageReturning
source: Returning
zh_cn: 返回中

# Scan_Runtime_ProgressStageCompleted
source: Completed
zh_cn: 已完成

# Scan_Runtime_PreviewModeRgbComposite
source: RGB Composite
zh_cn: RGB 合成

# Scan_Runtime_PreviewModeRawChannel
source: Raw Channel {0}
zh_cn: 原始通道 {0}

# Scan_Runtime_DngExportModeLinearRaw4
source: Single file: 4-channel raw DNG
zh_cn: 单文件：4 通道原始 DNG

# Scan_Runtime_ProfileDngExportModeLinearRaw4
source: 4-channel raw DNG
zh_cn: 4 通道原始 DNG

# Scan_Runtime_DngExportModeLinearRgbIrw
source: Two files: RGB plus IR/W DNG
zh_cn: 双文件：RGB 加 IR/W DNG

# Scan_Runtime_ChannelRoleRed
source: Red
zh_cn: 红

# Scan_Runtime_ChannelRoleGreen
source: Green
zh_cn: 绿

# Scan_Runtime_ChannelRoleBlue
source: Blue
zh_cn: 蓝

# Scan_Runtime_ChannelRoleWhite
source: White
zh_cn: 白

# Scan_Runtime_ChannelRoleUnused
source: Unused
zh_cn: 未使用

# Scan_Runtime_DeviceStatusConnecting
source: Connecting scanner hardware...
zh_cn: 正在连接扫描仪硬件...

# Scan_Runtime_DeviceStatusConnected
source: Scanner connected.
zh_cn: 扫描仪已连接。

# Scan_Runtime_DeviceStatusDetected
source: Scanner detected and ready to connect.
zh_cn: 已检测到扫描仪，可连接。

# Scan_Runtime_DeviceStatusMissing
source: No PRISM scanner (VID 0x0483 / PID 0x619C or 0x619D) detected.
zh_cn: 未检测到 PRISM 扫描仪（VID 0x0483 / PID 0x619C 或 0x619D）。

# Scan_Runtime_ConfigStatusMissing
source: No scan configuration loaded.
zh_cn: 尚未加载扫描配置。

# Scan_Runtime_ExecutionConfigUnavailable
source: Unavailable
zh_cn: 不可用

# Scan_Runtime_ExecutionConfigSummary
source: Rows: {0} | Motor: {1} | Line move: {2} | DNG: {3}
zh_cn: 行数：{0} | 电机：{1} | 单行移动：{2} | DNG：{3}

# Scan_Runtime_ExecutionConfigIntervalOnly
source: Interval {0} us
zh_cn: 间隔 {0} us

# Scan_Runtime_ScanStatusRunning
source: Scan running.
zh_cn: 扫描进行中。

# Scan_Runtime_ScanStatusComplete
source: Latest scan complete.
zh_cn: 最近一次扫描已完成。

# Scan_Runtime_ScanStatusWaiting
source: Waiting to start a scan.
zh_cn: 等待开始扫描。

# Scan_Runtime_ReadinessStopAvailable
source: Scan is running. Stop the current scan before changing setup.
zh_cn: 扫描正在运行。更改设置前请停止当前扫描。

# Scan_Runtime_ReadinessOutputBusy
source: An output operation is still running. Wait for it to finish before starting another scan.
zh_cn: 输出操作仍在进行。开始下一次扫描前请等待其完成。

# Scan_Runtime_ReadinessConnecting
source: Connecting scanner hardware...
zh_cn: 正在连接扫描仪硬件...

# Scan_Runtime_ReadinessNoDevices
source: Connect a PRISM scanner before starting.
zh_cn: 开始前请连接 PRISM 扫描仪。

# Scan_Runtime_ReadinessConnectFirst
source: Connect the scanner before starting.
zh_cn: 开始前请先连接扫描仪。

# Scan_Runtime_ReadinessConfigRequired
source: Load a scan configuration before starting.
zh_cn: 开始前请加载扫描配置。

# Scan_Runtime_ReadinessParametersMissing
source: Scanner parameters are still missing. Reconnect before starting.
zh_cn: 扫描仪参数仍缺失。开始前请重新连接。

# Scan_Runtime_ReadinessReady
source: Ready to start scanning.
zh_cn: 已准备好开始扫描。

# Scan_Runtime_OutputActionBusy
source: Output operation in progress.
zh_cn: 输出操作进行中。

# Scan_Runtime_OutputActionScanRunning
source: Scan is running.
zh_cn: 扫描进行中。

# Scan_Runtime_OutputActionReady
source: Save or export the latest scan result.
zh_cn: 保存或导出最近一次扫描结果。

# Scan_Runtime_OutputActionNoResult
source: No scan result is available yet.
zh_cn: 尚无可用扫描结果。

# Scan_Runtime_PreviewPlaceholderScanning
source: Preview updates will appear here while scanning.
zh_cn: 扫描期间预览会在此更新。

# Scan_Runtime_PreviewPlaceholderPrepareFirst
source: Connect devices and run a scan to populate the preview.
zh_cn: 连接设备并运行一次扫描以填充预览。

# Scan_Runtime_PreviewModeRawRole
source: Raw ({0})
zh_cn: 原始（{0}）

# Scan_Runtime_ErrorConfigProfileRequired
source: Load a scan configuration before starting.
zh_cn: 开始前请加载扫描配置。

# ScanDebug_Runtime_DeviceStateConnecting
source: Connecting
zh_cn: 连接中

# ScanDebug_Runtime_DeviceStateConnected
source: Connected
zh_cn: 已连接
